WcfServices/federation/IssuedTokenMultiSTS/result1/Iteration1/t1234786768_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/IForacstService/GetWeather</wsa:Action><wsa:MessageID>uuid:378d2f12-9da6-4e08-a1c9-d7f0379c6b43</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://localhost:9090/service</wsa:To></soap:Header><soap:Body><GetWeather xmlns="http://tempuri.org/"><city>abcde</city></GetWeather></soap:Body></soap:Envelope>